############################################################################
############################################################################
####05월 25일 기준 code file 구조
#(1)movies_확인_0525.R
############################################################################
############################################################################

## 분석환경설정
#전처리에 필요한 라이브러리
library(data.table)
library(tidyverse)
library(dplyr)
library(naniar)
library(VIM)
library(DT)
library(ggplot2)
#시각화에 필요한 라이브러리
#추천알고리즘 라이브러리
library(recommenderlab)
#----------------------------------------------------------------------------
## 2.데이터이해
### 2-1.데이터수집
m <- read.csv('./data/movies.csv',header=T) #fileEncoding='UTF-8' # m = movies
r <- read.csv('./data/ratings.csv',header=T) # r = ratings
t <- read.csv('./data/tags.csv',header=T) # t = tags
#----------------------------------------------------------------------------
### 2-2.데이터확인
df=m
#df=r
#df=t

glimpse(df)
summary(df)

# 결측치 확인
which(!complete.cases(df)) 
sum(is.na(df)); sum(!is.na(df))
# 이상치 확인
# 중복값 확인
sum(duplicated(df))

#결측치 요약 및 시각화
naniar::miss_case_summary(df) # case : 행 기준
naniar::miss_var_summary(df)  # variable : 변수 기준
naniar::gg_miss_var(df)
#VIM::aggr(df)
#----------------------------------------------------------------------------
#----------------------------------------------------------------------------
#----------------------------------------------------------------------------
#----------------------------------------------------------------------------