############################################################################
############################################################################
####05월 25일 기준 code file 구조
#(1)movies_확인_0525.R
#(2)movies_탐색_0525.R
#(3)ratings_탐색_0525.R
#(4)tags_탐색_0525.R
############################################################################
############################################################################

barplot(table(m$tag))
m$tag <- as.factor(m$tag)
unique(m$tag)

#https://statkclee.github.io/text/nlp-president-dtm.html 태그!!
#https://eda-ai-lab.tistory.com/525
#영화별 태그 
df <- m %>% group_by(userId) %>% summarise(tag=tag)

